In [6]:
import pandas as pd
df1 = pd.DataFrame({
    
    "city":["new york","chicago","orlando"],
    "temperature":[21,14,35]
    
})
df1

       city  temperature
0  new york           21
1   chicago           14
2   orlando           35

In [11]:

df2 = pd.DataFrame({
    
    "city":["chicago","new york","michigan"],
    "humidity":[68,65,75]
    
})
df2

       city  humidity
0   chicago        68
1  new york        65
2  michigan        75

In [12]:
#it is same as database join (intersection or inner-join)
#inner join is default 
df3 = pd.merge(df1,df2,on='city')
df3

       city  temperature  humidity
0  new york           21        65
1   chicago           14        68

In [13]:
#outer-join (union)

df3 = pd.merge(df1,df2,on='city',how="outer")
df3

       city  temperature  humidity
0  new york         21.0      65.0
1   chicago         14.0      68.0
2   orlando         35.0       NaN
3  michigan          NaN      75.0